# GetSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentPrintingEventArgs..::..GetSettings Method
DocumentPrintingEventArgs Class See Also
---
Gets the print settings of the active printing session.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public IPrintSetting GetSettings()
```

Visual Basic
---
```text
Public Function GetSettings As IPrintSetting
```

Visual C++
---
```text
public:
IPrintSetting^ GetSettings()
```

# ### Return Value
The print settings of the active printing session.
# See Also
DocumentPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace